ecommerce-app/app/Http/Controllers/DashboardController.php

select * from `product_categories`
---
    public function index(Request $request)
    {
        $query = Product::with('category');
        $categories = ProductCategory::all();

select * from `products` where `products`.`id` in (64, 64, 64, 0, 0)
select * from `viewed_products` where `user_id` = 'a6409c12-9bb5-4503-a5de-5becbb18ac67' order by `viewed_at` desc limit 5
---
        $products = $query->get();
        $recentlyViewedProducts = collect();
        if (Auth::check()) {
            $recentlyViewedProducts = ViewedProduct::where('user_id', Auth::id())
                ->with('product')
                ->orderBy('viewed_at', 'desc')
                ->take(5)
                ->get();