ecommerce-app/app/Http/Controllers/HomeController.php

select `user_reviews`.*, `order_items`.`product_id` as `laravel_through_key` from `user_reviews` inner join `order_items` on `order_items`.`id` = `user_reviews`.`order_item_id` where `order_items`.`product_id` in (64, 64, 64, 64, 64, 64, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
---
    public function index()
    {
        $products = Product::with('userReviews')
            ->withAvg('userReviews', 'rating')
            ->withCount('userReviews')
            ->get();