ecommerce-app/app/Http/Controllers/ProductController.php

    public function show(Product $product)
    {
        if (Auth::check()) {
            $userId = Auth::id();
            $alreadyViewed = ViewedProduct::where('user_id', $userId)
                ->where('product_id', $product->id)
                ->where('viewed_at', '>=', now()->subDay()) // Avoid duplicating views within 24 hours
                ->exists();

            if (!$alreadyViewed) {
                ViewedProduct::create([
                    'user_id' => $userId,
                    'product_id' => $product->id,
                    'viewed_at' => now(),
                ]);
            }
        }
        $userReviews = UserReview::withWhereHas('orderItem', function ($query) use ($product){
            $query->where('product_id', $product->id);
        })->get();
        $userReviewCount = $userReviews->count();
        $userReviewAverage = $userReviews->avg('rating');
---
select exists(select * from `viewed_products` where `user_id` = 'a6409c12-9bb5-4503-a5de-5becbb18ac67' and `product_id` = '64c06b04-65eb-11ef-b8eb-c025a54bbb1d' and `viewed_at` >= '2024-09-03 03:20:55') as `exists`
insert into `viewed_products` (`user_id`, `product_id`, `viewed_at`, `id`, `updated_at`, `created_at`) values ('a6409c12-9bb5-4503-a5de-5becbb18ac67', '64c06b04-65eb-11ef-b8eb-c025a54bbb1d', '2024-09-04 03:20:55', '\"90336216-143d-4810-aa60-9c7d8ed72134\"', '2024-09-04 03:20:55', '2024-09-04 03:20:55')
select * from `user_reviews` where exists (select * from `order_items` where `user_reviews`.`order_item_id` = `order_items`.`id` and `product_id` = '64c06b04-65eb-11ef-b8eb-c025a54bbb1d')